feat: mermaid charts
